# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [14]:
# your code here
import pandas as pd
from sqlalchemy import create_engine
sqlitedb_path = '/home/carpiero/test/data/juliarochflores.db'
engine = create_engine(f'sqlite:///{sqlitedb_path}')
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", engine)
df_rank_info = pd.read_sql_query("SELECT * FROM rank_info", engine)
df_personal_info = pd.read_sql_query("SELECT * FROM personal_info", engine)
df_join=pd.read_sql_query("""SELECT rank_info.name as Name, personal_info.age as Age, personal_info.country as Country   
                          FROM rank_info JOIN personal_info ON rank_info.id=personal_info.id""", engine)

display(df_rank_info.columns)
print(df_personal_info.columns)

df_join

Index(['id', 'name', 'position', 'Unnamed: 0'], dtype='object')

Index(['id', 'lastName', 'age', 'Unnamed: 0', 'gender', 'country', 'image'], dtype='object')

                 Name           Age                     Country
0          jefF BEZOs  54 years old               United States
1          bILL GATES  62 years old                        None
2      WARREN BUFFEtt  87 years old                        None
3     bernARD ARNAULT  69 years old                      France
4     maRK ZUCKERBERG          1985               United States
...               ...           ...                         ...
2203   zhao XIAOQiang  51 years old                       China
2204  zHOU LIANgzhang  55 years old                        None
2205     zhu XINGMIng  51 years old  People's Republic of China
2206         ZHUO JUN  52 years old                        None
2207      olguN ZOrlu  54 years old                      Turkey

[2208 rows x 3 columns]

# Challenge 2 - Working with JSON files

Import the pandas library.

In [15]:
# your code here
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [37]:
# your code here
path='/home/carpiero/ir/dataptmad0420/module-1/importing-exporting-data/data/'
nasa = pd.read_json(f'{path}nasa.json',orient='records')

Now that we have loaded the data, let's examine it using the `head()` function.

In [38]:
# your code here
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [39]:
# your code here
nasa['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [40]:
# your code here
nasa['fall'].value_counts().to_json(f'{path}nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [41]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [87]:
# your code here
shuttle=pd.read_csv(tst_url,names=cols,sep=' ',low_memory=False)

Let's verify that this worked by looking at the `head()` function.

In [86]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [89]:
# your code here
shuttle.to_csv(f'{path}shuttle.csv', index=False, sep=',')

In [118]:
# bonus octavio
col_octavio=pd.read_csv(f'{path}Supply_Food_Data_Descriptions.csv',low_memory=False)
cols=col_octavio['Categories'].to_list()
cols_country=['country']
for x in cols:
    cols_country.append(x)   
    
octavio=pd.read_csv(f'{path}Food_Supply_Quantity_kg_Data_No_Header.txt',names=cols_country,sep='\t',low_memory=False)

In [119]:
octavio.head()

,country,Alcoholic Beverages,Animal fats,Animal Products,"Aquatic Products, Other",Cereals - Excluding Beer,Eggs,"Fish, Seafood",Fruits - Excluding Wine,Meat,...,Pulses,Spices,Starchy Roots,Stimulants,Sugar & Sweeteners,Sugar Crops,Treenuts,Vegetable Oils,Vegetables,Vegetal Products
0,Afghanistan,0.0014,0.1973,9.4341,0.0,24.8097,0.2099,0.0350,5.3495,1.2020,...,0.2953,0.0574,0.8802,0.3078,1.3489,0.0,0.0770,0.5345,6.7642,40.5645
1,Albania,1.6719,0.1357,18.7684,0.0,5.7817,0.5815,0.2126,6.7861,1.8845,...,0.2380,0.0008,1.8096,0.1055,1.5367,0.0,0.1515,0.3261,11.7753,31.2304
2,Algeria,0.2711,0.0282,9.6334,0.0,13.6816,0.5277,0.2416,6.3801,1.1305,...,0.4783,0.0557,4.1340,0.2216,1.8342,0.0,0.1152,1.0310,11.6484,40.3651
3,Angola,5.8087,0.0560,4.9278,0.0,9.1085,0.0587,1.7707,6.0005,2.0571,...,0.6507,0.0009,18.1102,0.0508,1.8495,0.0,0.0061,0.6463,2.3041,45.0722
4,Antigua and Barbuda,3.5764,0.0087,16.6613,0.0,5.9960,0.2274,4.1489,10.7451,5.6888,...,0.1840,0.1524,1.4522,0.1564,3.8749,0.0,0.0253,0.8102,5.4495,33.3233

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [123]:
# your code here
astronauts = pd.read_excel(f'{path}astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [124]:
# your code here
astronauts.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

In [126]:
astronauts.dtypes

Name                           object
Year                          float64
Group                         float64
Status                         object
Birth Date             datetime64[ns]
Birth Place                    object
Gender                         object
Alma Mater                     object
Undergraduate Major            object
Graduate Major                 object
Military Rank                  object
Military Branch                object
Space Flights                   int64
Space Flight (hr)               int64
Space Walks                     int64
Space Walks (hr)              float64
Missions                       object
Death Date             datetime64[ns]
Death Mission                  object
dtype: object

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [129]:
# your code here
astronauts['Undergraduate Major'].value_counts()

Physics                                                                35
Aerospace Engineering                                                  33
Mechanical Engineering                                                 30
Aeronautical Engineering                                               28
Electrical Engineering                                                 23
                                                                       ..
Aerospace Engineering & Mechanics                                       1
Industrial Management                                                   1
Mathematical & Electrical Science                                       1
Chemistry; Physiological Optics                                         1
Aeronautics & Astronautics; Earth, Atmospheric & Planetary Sciences     1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [130]:
# your code here
astronauts.to_csv(f'{path}astronaut.csv', index=False, sep='\t')

In [131]:
o=pd.read_csv(f'{path}astronaut.csv', sep='\t')

In [132]:
o.dtypes

Name                    object
Year                   float64
Group                  float64
Status                  object
Birth Date              object
Birth Place             object
Gender                  object
Alma Mater              object
Undergraduate Major     object
Graduate Major          object
Military Rank           object
Military Branch         object
Space Flights            int64
Space Flight (hr)        int64
Space Walks              int64
Space Walks (hr)       float64
Missions                object
Death Date              object
Death Mission           object
dtype: object

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [142]:
# your code here
names=['Season','Age','Childish diseases','Accident','Surgical intervention','High fevers','Frequency of alcohol consumption',
       'Smoking habit','Number of hours spent sitting per day','Output']
fertility=pd.read_csv(f'{path}fertility_Diagnosis.txt', names=names,sep=',')

fertility.head()

,Season,Age,Childish diseases,Accident,Surgical intervention,High fevers,Frequency of alcohol consumption,Smoking habit,Number of hours spent sitting per day,Output
0,-0.33,0.69,0,1,1,0,0.8,0,0.88,N
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O

In [139]:
fertility.shape

(100, 10)

In [140]:
fertility.dtypes

Season                                   float64
Age                                      float64
Childish diseases                          int64
Accident                                   int64
Surgical intervention                      int64
High fevers                                int64
Frequency of alcohol consumption         float64
Smoking habit                              int64
Number of hours spent sitting per day    float64
Output                                    object
dtype: object

In [141]:
fertility.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 10 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   Season                                 100 non-null    float64
 1   Age                                    100 non-null    float64
 2   Childish diseases                      100 non-null    int64
 3   Accident                               100 non-null    int64
 4   Surgical intervention                  100 non-null    int64
 5   High fevers                            100 non-null    int64
 6   Frequency of alcohol consumption       100 non-null    float64
 7   Smoking habit                          100 non-null    int64
 8   Number of hours spent sitting per day  100 non-null    float64
 9   Output                                 100 non-null    object
dtypes: float64(4), int64(5), object(1)
memory usage: 13.6 KB